<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/pandas_chap12_0801.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
data_list = [{'date':'2000-06-27'},
             {'date':'2002-09-14'},
             {'date':'2005-12-20'}]
df = pd.DataFrame(data_list, columns=['date'])
df

         date
0  2000-06-27
1  2002-09-14
2  2005-12-20

In [3]:
def extract_year(date): # 연도를 추출하는 함수
  return date.split('-')[0]

In [4]:
df['year']=df['date'].map(extract_year)   # apply와 사용방법이 동일함

In [5]:
df

         date  year
0  2000-06-27  2000
1  2002-09-14  2002
2  2005-12-20  2005

In [6]:
job_list = [{'age':20,'job':'student'},
            {'age':30,'job':'developer'},
            {'age':30,'job':'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [7]:
df.job = df.job.map({'student':1, 'developer':2, 'teacher':3})
# map 함수를 사용하면 apply처럼 함수를 통해서 column을 변경시킬 수 있고
# 딕셔너리를 직접 전달함으로써 원하는 값으로 변경할 수 있다.

In [8]:
df

   age  job
0   20    1
1   30    2
2   30    3

In [9]:
x_y = [{'x':5.5,'y':-5.6,'z':-1.1},
       {'x':-5.2,'y':5.5,'z':-2.2},
       {'x':-1.6,'y':-4.5,'z':-3.3}]
df = pd.DataFrame(x_y)

In [10]:
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

모든 column을 변경하고 싶을 때 applymap함수를 사용한다.

In [11]:
import numpy as np

In [12]:
df = df.applymap(np.around) # 모든 column에 대해 반올림한 것

In [13]:
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0